Revit 2027 API
AnalyticalEquipmentLoadData.PowerFactorState Property
 The PowerFactorState type of the analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PowerFactorStateType PowerFactorState { get; set; }
Public Property PowerFactorState As PowerFactorStateType
	Get
	Set
public:
property PowerFactorStateType PowerFactorState {
	PowerFactorStateType get ();
	void set (PowerFactorStateType value);
}
member PowerFactorState : PowerFactorStateType with get, set
Property Value
PowerFactorStateType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace